blogger_ruby/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "hihihhi"], ["created_at", "2021-10-01 00:55:40.594185"], ["updated_at", "2021-10-01 00:55:40.594185"], ["title", "hihih"]]